# Проект FitLife - MVP версия 1.0


# Константы для расчета потребления воды
WATER_PER_KG = 30  # Норма потребления на кг веса пользователя
CONVERSION_ML_TO_L = 1000  # Перевод из миллилитров в литры

# Приветствуем пользователя
print('Здравствуйте!')

# Спрашиваем имя пользователя
# Преобразуем, чтобы первая буква всегда была заглавной, остальные - строчные
# Убираем возможные пробелы в начале и в конце
while True:
    user_name = input('Укажите ваше имя: ').strip().capitalize()
    if user_name.isalpha() is False:
        print('Имя не должно быть пустым или содержать цифры или знаки\n')
    else:  # Останавливаем цикл при корректном вводе
        break

# Спрашиваем возраст пользователя
while True:  # Цикл корректности ввода
    try:
        user_age = int(input('Укажите ваш возраст (пример: 25): '))
        if user_age <= 0:  # Проверка ввода отрицательного значения или 0
            print('Значение не должно быть меньше или равно нулю\n')
        else:  # Останавливаем цикл при корректном вводе
            break
    except ValueError:  # Сообщение при некорректном вводе
        print('Значение не может быть пустым или содержать буквы и знаки\n')

# Спрашиваем вес пользователя
while True:  # Цикл корректности ввода
    try:
        user_weight = float(input('Укажите ваш вес в кг (пример: 65): '))
        if user_weight <= 0:  # Проверка ввода отрицательного значения или 0
            print('Значение не должно быть меньше или равно нулю\n')
        else:  # Останавливаем цикл при корректном вводе
            break
    except ValueError:  # Сообщение при некорректном вводе
        print('Значение не может быть пустым или содержать буквы и знаки\n')

# Спрашиваем рост пользователя
while True:  # Цикл корректности ввода
    try:
        user_height = float(input('Укажите ваш рост в м (пример: 1.75): '))
        if user_height <= 0:  # Проверка ввода отрицательного значения или 0
            print('Значение не может быть меньше или равен нулю\n')
        else:  # Останавливаем цикл при корректном вводе
            break
    except ValueError:  # Сообщение при некорректном вводе
        print('Значение не может быть пустым или содержать буквы и знаки\n')

# Расчет индекса массы тела
bmi = round(user_weight / (user_height ** 2), 1)

# Расчет нормы потребления воды в литрах
water_l = round((user_weight * WATER_PER_KG) / CONVERSION_ML_TO_L, 1)

# Вывод результата
print(f'\nОтчет для пользователя: {user_name} ({user_age} г.)')
print(f'Индекс массы тела: {bmi}')
print(f'Рекомендуемая норма воды: {water_l} л. в день')
print('\nРасчет окончен. Будьте здоровы!')
