# Проект FitLife - MVP версия 1.0


# Спрашиваем имя пользователя
# Преобразуем, чтобы первая буква всегда была заглавной, остальные - строчные
# Убираем возможные пробелы в начале и в конце
user_name = input('Здравствуйте! Укажите ваше имя: ').strip().capitalize()

# Спрашиваем возраст пользователя
user_age = int(input('Укажите ваш возраст: '))

# Спрашиваем вес пользователя
user_weight = float(input('Укажите ваш вес в кг: '))

# Спрашиваем рост пользователя
user_height = float(input('Укажите ваш рост в м, используя точку: '))

# Расчет индекса массы тела
bmi = round(user_weight / (user_height ** 2), 1)

# Константы для расчета потребления воды
WATER_PER_KG = 30  # Норма потребления на кг веса пользователя
CONVERSION_ML_TO_L = 1000  # Перевод из миллилитров в литры

# Расчет нормы потребления воды в литрах
water_l = round((user_weight * WATER_PER_KG) / CONVERSION_ML_TO_L, 1)

# Вывод результата
print(f'\nОтчет для пользователя: {user_name} ({user_age} г.)')
print(f'Индекс массы тела: {bmi}')
print(f'Рекомендуемая норма воды: {water_l} л. в день')
print('\nРасчет окончен. Будьте здоровы!')
